## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.name_servers["ns1-36.azure-dns.com."] must be replaced
-/+ resource "cloudflare_record" "name_servers" {
      ~ created_on      = "2024-02-20T18:40:25.208527Z" -> (known after apply)
      ~ hostname        = "games.ruut.me" -> (known after apply)
      ~ id              = "a17e5b9248393ef45c56401abf7bc62a" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2024-02-20T18:40:25.208527Z" -> (known after apply)
      ~ name            = "games.ruut.me" -> "pelit.ruut.me" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - proxied         = false -> null
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "ns1-36.azure-dns.com" -> "ns1-36.azure-dns.com."
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.name_servers["ns2-36.azure-dns.net."] must be replaced
-/+ resource "cloudflare_record" "name_servers" {
      ~ created_on      = "2024-02-20T18:40:25.009268Z" -> (known after apply)
      ~ hostname        = "games.ruut.me" -> (known after apply)
      ~ id              = "bc5b1e2a5d1a5ca13d374ef97947c4c3" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2024-02-20T18:40:25.009268Z" -> (known after apply)
      ~ name            = "games.ruut.me" -> "pelit.ruut.me" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - proxied         = false -> null
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "ns2-36.azure-dns.net" -> "ns2-36.azure-dns.net."
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.name_servers["ns3-36.azure-dns.org."] must be replaced
-/+ resource "cloudflare_record" "name_servers" {
      ~ created_on      = "2024-02-20T18:40:24.683741Z" -> (known after apply)
      ~ hostname        = "games.ruut.me" -> (known after apply)
      ~ id              = "647e8da614349912d8979cdbcee836c0" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2024-02-20T18:40:24.683741Z" -> (known after apply)
      ~ name            = "games.ruut.me" -> "pelit.ruut.me" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - proxied         = false -> null
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "ns3-36.azure-dns.org" -> "ns3-36.azure-dns.org."
        # (3 unchanged attributes hidden)
    }

  # cloudflare_record.name_servers["ns4-36.azure-dns.info."] must be replaced
-/+ resource "cloudflare_record" "name_servers" {
      ~ created_on      = "2024-02-20T18:40:24.56736Z" -> (known after apply)
      ~ hostname        = "games.ruut.me" -> (known after apply)
      ~ id              = "26130b2d182a33d2f8b108c5583a2f49" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2024-02-20T18:40:24.56736Z" -> (known after apply)
      ~ name            = "games.ruut.me" -> "pelit.ruut.me" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - proxied         = false -> null
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      ~ value           = "ns4-36.azure-dns.info" -> "ns4-36.azure-dns.info."
        # (3 unchanged attributes hidden)
    }

  # module.virtual_machines.azurerm_dns_a_record.game_record will be created
  + resource "azurerm_dns_a_record" "game_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cs1"
      + records             = [
          + "20.91.214.78",
        ]
      + resource_group_name = "cs2-servers"
      + ttl                 = 300
      + zone_name           = "pelit.ruut.me"
    }

  # module.virtual_machines.cloudflare_record.game_record will be destroyed
  # (because cloudflare_record.game_record is not in configuration)
  - resource "cloudflare_record" "game_record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-02-20T19:22:59.786963Z" -> null
      - hostname        = "cs1.games.ruut.me" -> null
      - id              = "150a87be7ee01c49bee43edd514a4a4f" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2024-02-20T19:22:59.786963Z" -> null
      - name            = "cs1.games.ruut.me" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "20.91.214.78" -> null
      - zone_id         = (sensitive value) -> null
    }

Plan: 5 to add, 0 to change, 5 to destroy.
```
</details>